Revit 2023 API
FabricWireItem.OffsetAlongWire Property
 Offset along wire direction Wire distance should be 0 if we want to be along the same wire
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2018
Syntax
C#
public double OffsetAlongWire { get; set; }
Visual Basic
Public Property OffsetAlongWire As Double
	Get
	Set
Visual C++
public:
property double OffsetAlongWire {
	double get ();
	void set (double value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The given value for offset is not a number
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The given value for offset must be between 0 and 30000 feet.
Autodesk.Revit.Exceptions.DisabledDisciplineException |  When setting this property: None of the following disciplines is enabled: Structural.
See Also
FabricWireItem Class
Autodesk.Revit.DB.Structure Namespace